app/controllers/comments_controller.rb

SELECT * FROM `posts` WHERE (`posts`.`id` = 2)
---
  def index
    @post = Post.find(params[:post_id])

SELECT * FROM `posts` WHERE (`posts`.`id` = 2)
SELECT * FROM `comments` WHERE (`comments`.`id` = 1 AND (`comments`.post_id = 2))
---
  def show
    @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])

SELECT * FROM `posts` WHERE (`posts`.`id` = 2)
---
  def new
    @post = Post.find(params[:post_id])

SELECT * FROM `posts` WHERE (`posts`.`id` = 2)
INSERT INTO `comments` (`updated_at`, `body`, `post_id`, `commenter`, `created_at`) VALUES('2010-04-30 21:16:48', 'e', 2, 'd', '2010-04-30 21:16:48')
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(params[:comment])
    if @comment.save