app/controllers/posts_controller.rb

  def index
    @posts = Post.find(:all, :order => "created_at DESC")
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)

  def parked
    @posts = Post.find(:all, :conditions => ["length(response)=0"], :order => "created_at DESC")
---
SELECT * FROM `posts` WHERE (length(response)=0) ORDER BY created_at DESC

  def thumbs
    if params[:period] == "Recent" then
      @posts = Post.find(:all, :conditions => ["length(response)!=0"], :order => "created_at DESC")
---
SELECT * FROM `posts` WHERE (created_at > '2009-05-20 10:34:15' AND response is not null) ORDER BY rate DESC

  def rateup
    @post = Post.find(params[:id])
    @post.rate = @post.rate + 1
    @post.save
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 3)
UPDATE `posts` SET `rate` = -3, `updated_at` = '2010-05-03 17:20:43' WHERE `id` = 2

  def ratedn
    @post = Post.find(params[:id])
    @post.rate = @post.rate - 1
    @post.save
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
UPDATE `posts` SET `rate` = -1, `updated_at` = '2010-05-03 16:33:55' WHERE `id` = 2

  def create
    @post = Post.new(params[:post])
    @post.rate = 0
    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`name`, `response`, `updated_at`, `title`, `rate`, `content`, `created_at`) VALUES(NULL, 'b', '2010-05-13 18:40:32', NULL, NULL, 'a', '2010-05-13 18:30:00')

  def update
    @post = Post.find(params[:id])
    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
UPDATE `posts` SET `updated_at` = '2010-05-14 18:32:21', `response` = 'Verifying post secondary degrees is an important step in the hiring process. Hiring supervisors, or designated staff, are required to verify that the final applicant holds a valid degree when required and presented on their application. To do this, they use either the Texas Higher Education Coordinating Board web page: http://www.thecb.state.tx.us/apps/consumerinfo/notx.cfm or the U.S. Department of Education\'s database of accredited post-secondary institutions http://www.ope.ed.gov/accreditation/. In the event the final applicant has a substandard or fraudulent degree, they are notified and given an opportunity to respond. If the response is deemed inadequate or insufficient, the applicant is disqualified from the hiring process. Additionally, Human Resources staff periodically conducts audits of employee degrees and institutions. \r\n\r\nThe level at which jobs may be posted to allow experience to be substituted for education is at the discretion of the division director. Full substitution of education or experience is allowed when posting positions in salary group B22 and below, unless the position requires license, certification, or registration. \r\n\r\nThis information is available to everyone to reference in the HR Manual. (See Education, Certification, and License Checks in 1-8, Making a Hiring Decision.) \r\n', `name` = 'Dear Accredited' WHERE `id` = 27